NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A020F512GM48.svd
        <register>
          <name>EXTIPSELL</name>
          <description>External Interrupt Port Select Low</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL4</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL5</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL6</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL7</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPSELH</name>
          <description>External interrupt Port Select High</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPINSELL</name>
          <description>External Interrupt Pin Select Low</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPINSEL0</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL1</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL2</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL3</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL4</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL5</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL6</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL7</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
